app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    if session[:issorted]=~ /^title$/
      @movies = Movie.find(:all).order('title')
    elsif session[:issorted]=~ /^release_date$/
      @movies = Movie.find(:all).order('release_date')
    end
    @movies = Movie.all